spot_info = {
    1: {
        "spot_name": "宝泉寺の井上源三郎のお墓",
        "spot_trivia": "宝泉寺にある井上源三郎のお墓は、新選組ファンにとって訪れたいスポットのひとつ。六番隊長として新選組を支えた井上源三郎が兄・松五郎や、彼の最期を看取った泰助と共に眠っています。駐車場からも見える顕彰碑も見逃せません。"
    },
    2: {
        "spot_name": "日野八坂神社",
        "spot_trivia": "日野八坂神社には、新選組の精神が宿る「天然理心流奉納額」が掲げられています。佐藤彦五郎が天然理心流の道場を開き、ここで新選組の主要メンバーが剣術を学びました。剣術奉納額に刻まれた彼らの名前を見れば、新選組と神社の深い絆が感じられるでしょう。"
    },
    3: {
        "spot_name": "とんがらし地蔵",
        "spot_trivia": "幼いころに両親を失った新選組一番隊組長・沖田総司。母親が日野出身だったこともあり、彼は一時期、日野にある親類の家に身を寄せて暮らしていました。とんがらし地蔵の近くに姉夫婦と住んでいた総司は、ここで仲間と夢を語り合っていたかもしれません。"
    },
    4: {
        "spot_name": "大昌寺と佐藤家の歴史",
        "spot_trivia": "大昌寺は、日野宿の名主を務めた佐藤家の墓所があるお寺。特に新選組の支援者であった佐藤彦五郎や、彼の妻で土方歳三の姉・ノブが眠っています。佐藤家のルーツや日野の歴史に触れられる場所として、訪れる価値があります。"
    },
    5: {
        "spot_name": "新選組ふるさと資料館",
        "spot_trivia": "新選組ふるさと資料館では、日野と新選組の深い関わりを通して、彼らの真の姿を発見することができます。近藤勇の書状や土方歳三の義兄・佐藤彦五郎の日記、さらには戊辰戦争にまつわる資料も充実。歴史を感じるひとときが待っています。"
    },
    6: {
        "spot_name": "佐藤彦五郎資料館",
        "spot_trivia": "佐藤彦五郎資料館では、新選組の結成前から隊士を支え続けた佐藤彦五郎と、新選組との深い絆が感じられる品々を展示。土方歳三が姉のノブに贈った茶器や手紙など、当時の温もりが伝わる貴重な展示品が並びます。"
    },
    7: {
        "spot_name": "日野宿本陣",
        "spot_trivia": "日野宿本陣は、江戸時代に高貴な人々が泊まる特別な宿泊施設でした。新選組副長・土方歳三も青春時代をここで過ごし、剣術を学びました。建物の装飾や当時の風情に触れ、歴史を感じてみてください。"
    },
    8: {
        "spot_name": "日野宿交流館",
        "spot_trivia": "日野宿交流館は、歴史好きの方や新選組ファンにとって、見逃せないスポット。日野宿や新選組にまつわる展示が充実しており、観光案内や日野の特産品も購入できます。"
    },
    9: {
        "spot_name": "普門寺",
        "spot_trivia": "普門寺は、多摩八十八ヶ所霊場の八十四番札所。日野市のシンボルとして親しまれる「けんころ地蔵」が祀られており、健康と長寿を祈る人々が訪れます。"
    }
}
